Repository: bravesoftdz/b2evolution-locale-eo
Catalog: LC_MESSAGES/static.po
Languages: eo

source: b2evo package
eo: b2evolution-pako

source: Start page
eo: Startpaĝo

source: Version
eo: Eldono

source: After install
eo: Post instalado

source: Blogs
eo: Kolektoj

source: Admin
eo: Administrado

source: Before install
eo: Antaŭ instalado

source: Hello!
eo: Saluton!

source: Changelog
eo: Ŝanĝoprotokolo

source: Installer
eo: Instalilo

source: You are about to install the b2evolution multilingual multiuser multiblog engine. You can learn more about b2evolution by visiting <a %s>b2evolution.net</a> .
eo: Vi estas instalonta la plurlingvan plurlingvan programon b2evolution, kiu permesas plurajn uzantojn. Vi povas plu lerni pri b2evolution per vizito al <a %s>b2evolution.net</a>

source: Below are some quick instructions designed to help you. Please pick your prefered language and read on...
eo: Jen kelkaj kernaj instrukcioj destinitaj por helpi vin. Bonvolu elekti preferatan lingvon kaj plu legi…

source: Quickstart instructions
eo: Kernaj instrukcioj

source: If you don't have a webserver yet, check out our selection of <a %s>recommended web hosting companies</a> which offer easy, automated install of b2evolution.
eo: Se vi ankaŭ ne havas TTT-servilon, kontrolu niajn elektojn de <a %s>rekomendindaj TTT-paĝaj gastigantaj kompanioj</a>, kiuj ofertas facilan aŭtomatan instaladon de b2evolution.

source: If you already have a PHP/MySQL webserver, you can set up this copy of b2evolution in just a few minutes. Just follow the instructions matching your situation:
eo: Se vi jam havas TTT-servilon kun PHP kaj MySQL, vi povas agordi ĉi tiun ekzempleron de b2evolution ene de nur kelkaj minutoj. Nur faru la instrukciojn kongruajn kun via situacio:

source: Installing b2evolution from scratch
eo: Nova instalaĵo de b2evolution

source: Upgrading from a previous version of b2evolution
eo: Ĝisdatigo disde antaŭa eldono de b2evolution

source: Upgrading from other blog software:
eo: Promocio disde alia bloga programo:

source: Beta software
eo: Beta programo

source: This is a BETA release!
eo: Ĉi tio estas beta redakcio.

source: There are still bugs we know of, but we consider the software to be globally operational!
eo: Ankoraŭ ekzistas cimoj konataj, sed ni konsideras la programon pli-malpli funkcia.

source: NOTE: This version is and will continue to be fully supported in the upgrading scheme and procedures.
eo: NOTO: Ĉi tiu eldono estas kaj estos ade subtenataj ĉe la promociaj skemo kaj proceduroj.

source: Online resources
eo: Enretaj rimedoj

source: Official website
eo: Oficiala TTT-paĝaro

source: Find a host
eo: Trovi gastiganton

source: Manual
eo: Manlibro

source: Forums
eo: Forumoj

source: GNU GPL license
eo: La permesilo GPL de GNU

source: Contact
eo: Kontakti

source: To install b2evolution you need a PHP/MySQL web server (see <a %s>requirements</a>). Renting a fast server from a reputable hosting company is getting cheaper every day. Check out our <a %s>recommended hosting offers</a>.
eo: Por instali b2evolution-on vi bezonas TTT-servilon kun PHP kaj MySQL (vidu <a %s>postulojn</a>). Lui rapidan TTT-servilon de renoma TTT-paĝa gastiganta kompanio estas konstante pli kaj pli malmultekoste. Kontrolu la <a %s>rekomendindajn TTT-paĝajn gastigantajn ofertojn</a>.

source: Before you begin, please note that some network features of b2evolution require you to agree our simple <a %s>Terms of service</a>.
eo: Antaŭ ol vi komencas bonvolu noti, ke iuj retaj trajtoj de b2evolution postulas, ke vi konsentu pri niaj simplaj <a %s>uzkondiĉoj</a>.

source: Once you have unzipped the b2evolution distribution on your local computer:
eo: Tuj post kiam vi elpakis la b2evolution-distribuaĵon en vian lokan komputilon:

source: On your server, try to create a new (empty) MySQL database for b2evolution (For example, you can call it "b2evolution". The exact procedure to create a new database depends on your host/server setup. Alternatively, you can also use an existing database which b2evolution will share with existing applications.)
eo: En via servilo provu krei novan (vakan) MySQL-datumbazon por b2evolution (ekz-e vi povas nomi ĝin "b2evolution". La preciza proceduro por krei novan datumbazon dependas de viaj gastiganto kaj servilo. Alternative vi povas ankaŭ uzi jaman datumbazon, kiu b2evolution kunuzos kun jamaj programoj.)

source: Note:
eo: Noto:

source: b2evolution will create about 25 tables in the database you select. Unless you changed the config, all these tables' names will be prefixed with evo_ . Unless you already have an application using the same prefix, this makes it safe to install b2evolution in a database shared with other applications. Your existing tables will not be affected in any way.
eo: b2evolution kreos proksimume 25 tabelojn en la datumbazo elektota. Se vi ne ŝanĝis la agordon, la tuto de tiuj tabeloj estos antaŭmetitaj de evo_. Se vi ne jam havas programon kun la sama antaŭmetaĵo, tio certigas, ke estas sekure instali b2evolution-on en datumbazo kunuzata kun aliaj programoj. Viaj jamaj tabeloj restos netuŝitaj.

source: Upload the b2evolution files to your website.
eo: Alŝutu al via TTT-ejo la b2evolution-dosierojn.

source: Only the contents of the <code>/blogs</code> directory need to be uploaded to your site. If you want b2evolution to handle the homepage of your site, upload the contents of the <code>/blogs</code> folder to your website root. Otherwise, it's best to upload the files to a subdirectory of your webserver. You can keep the <code>/blogs</code> subdirectory name, but you can also choose another.
eo: La enhavo de la dosierujo <code>/blogs</code> devas esti alŝutota al via TTT-ejo. Se vi volas, ke b2evolution pritraktu la ĉefpaĝon de via TTT-ejo, alŝutu al via TTT-ejo radiko la enhavon de la dosierujo <code>/blogs</code>. Aliokaze estas plej bone alŝuti al subdosierujo de via TTT-servilo la dosierojn. Vi povas pluuzi la subdosierujan nomon <code>/blogs</code>, sed vi ankaŭ povas elekti alian nomon.

source: Run the installation script on your server. Go to the following address in your web borwser <code>http://yoursite.com/yourfolder/install/index.php</code> (replace yoursite.com and yourfolder depending on where you installed). Then, simply follow the on screen instructions.<br /> <br /> The installer will ask you a few questions, create required database tables and configure b2evolution for you.
eo: Plenumigu la instalado-skripto en via servilo. Vizitu la jenan adreson en via TTT-legilo: <code>http://viaretejo.com/viadosierujo/install/index.php</code> (anstataŭigi je viaretejo.com kaj viadosierujo depende de kien ĝin vi instalis). Do, nur faru la surekranajn instrukciojn.<br /> <br /> La instalilo prezentos al vi kelkajn demandojn, kreos la bezonatajn datumbazajn tabeloj kaj agordos b2evolution-on por vi.

source: Check to make sure the new installation works.
eo: Konstatu por konstati, ke la nova instalaĵo funkcias.

source: On production servers, it is recommended that you delete the <code>/install</code> subfolder.
eo: En stabilaj instalaĵoj estas rekomendinde ke vi forigu la subdosierujon <code>/install</code>.

source: After basic install is done, there are a few <a %s>tricky things you may need to take care of</a> (online manual).
eo: Post kiam kerna instalado estas farita estas kelkaj <a %s>implikaĵoj, kiujn vi eble devos solvi</a> (enreta manlibro).

source: Upgrading from Cafelog/b2
eo: Promocio disde Cafelog/b2

source: Upgrading from b2/Cafelog
eo: Promocio disde b2/Cafelog

source: If you would like to upgrade from the original b2/Cafelog (versions 0.5.x up to 0.6.2), please follow these steps:
eo: Se vi volus promocii disde la originala b2/Cafelog (eldonoj 0.5.x ĝis 0.6.2), bonvolu fari la jenajn paŝojn:

source: Do <strong>not</strong> install the current version of b2evolution right now. Instead, download b2evolution version 1.x. You can download <a %s>almost any version of b2evolution here</a>.
eo: <strong>Ne</strong> nun instali la aktualan eldonon de b2evolution. Anstataŭe elŝuti eldonon 1.x de b2evolution. Vi povas <a %s>elŝuti preskaŭ ĉiun ajn eldonon de b2evolution</a>.

source: Follow the instructions incuded in b2evolution 1.x to upgrade from b2/Cafelog.
eo: Faru la instrukciojn inkluzivitajn en eldono 1.x de b2evolution por promocii disde b2/Cafelog.

source: Come back to the current version of b2evolution and <a %s>upgrade from b2evolution 1.x to the current version</a>.
eo: Reiru al la aktuala eldono de b2evolution kaj <a %s>promociu disde eldono 1.x de b2evolution ĝis la aktuala eldono</a>.

source: Backup all your b2evolution files. Take special care of the files you may have modified, including <strong>/conf</strong>, <strong>/skins</strong>, <strong>/plugins</strong>, your <strong>/media</strong> directory and possibly stubfiles, hacks or custom templates...
eo: Sekurkopiu ĉiujn el la dosieroj de b2evolution. Ege zorgu pri la dosierujo, kiujn vi eble modifis, inkluzive de <strong>/conf</strong>, <strong>/skins</strong>, via dosierujo <strong>/media</strong> kaj eble ĝermdosieroj, evitaĵoj kaj propraj ŝablonoj…

source: You should also backup your database if you can. This functionality should be provided by your host.
eo: Estas rekomendinde ke vi ankaŭ sekurkopii la datumbazon se eble. Tiu ebleco estu provizata de via gastiganto.

source: If you are upgrading from a version prior to 2.0, we highly recommend you clean up outdated files. To achieve this, delete your b2evolution folders <strong>except /media</strong>. Folders to delete include /admin, /conf, /cron, /htsrv, /inc, /install, /plugins, /skins, /skins_adm, /xmlsrv. Depending on your version, you may not have all of these folders on your server. Also, again, make sure you have a backup before deleting.
eo: Se vi promocias disde eldono pli malnova ol 2.0, ni rekomendegas, ke vi forigu malaktualajn dosierojn. Por atingi tion forigu la dosierujojn de b2evolution, <strong>escepte de /media</strong>. Dosierujoj forigindaj estas inter aliaj /admin, /conf, /cron, /htsrv, /inc, /install, /plugins, /skins, /skins_adm, /xmlsrv. Depende de via eldono vi eble ne devos sekurkopii ĉiujn el tiuj dosierujoj en via TTT-servilo. Ankaŭ certigu, ke vi havas sekurkopion antaŭ ol forigi.

source: Upload <strong>all new b2evolution files from the /blogs folder</strong> to your site. We cannot stress this enough: <strong>ALL FILES</strong>! And that means you cannot reuse your default /conf files, default skin templates or default plugins if you have modified them without renaming them.<br /> <br /> Since your custom configurations, custom skins and custom plugins should be using different names, they should typically not be overwritten. Same for your media files.<br /> <br /> The single one file you must absolutely pay attention to is <code>/blogs/conf/_basic_config.php</code>. You will need to either keep, recreate or restore that file from backup (see step 1) before you can proceed with the upgrade.
eo: Alŝutu al via TTT-ejo <strong>ĉiujn novajn dosierojn el la dosierujo /blogs de b2evolution<strong>. Ne eblas sufiĉe emfazi: <strong>ĉiujn dosierojn</strong>! Kaj subkompreneble vi ne povas reuzi la apriorajn dosierojn en /conf, apriorajn etosojn kaj ŝablonojn aŭ apriorajn kromprogramojn, se vi modifis ilin sen alinomo de ili.<br /> <br /> Ĉar viaj agordaĵoj, propraj etosoj kaj kromprogramoj uzu aliajn nomojn, ili tipe ne estos anstataŭigitaj. Same viaj dosieroj en /media.<br /> <br /> La sola dosiero, kiun vi tute devas atenti estas <code>/blogs/conf/_basic_config.php</code>. Vi devos konservi, rekrei aŭ restarigi tiun dosieron de sekurkopion (vidu je paŝo 1) antaŭ ol vi povos daŭrigi la promocion.

source: Run the installation/upgrade script on your server. It is located in <code>http://yoursite.com/yourblogsfolder/install</code>/ . Then, simply follow the on screen instructions.<br /> <br /> The installer/upgrader will allow you to run a database upgrade from <strong>any</strong> b2evolution version to the new one.
eo: Plenumigu la instalan/promocian skripton en via servilo. Ĝi troviĝas en <code>http://viaretejo.com/viakolektarodosierujo/install</code>/. Poste nur faru la surekranajn instrukciojn.<br /> <br /> La instalilo/promociilo lasos, ke vi plenumigu datumbazan promocion disde <strong>ĉiu ajn</strong> eldono de b2evolution al la nova.

source: Check the online manual for <a %s>specific upgrade instructions</a> to your new version of b2evolution.
eo: Kontrolu la enretan manlibron por <a %s>specifaj instrukcioj pri promociado</a> al via nova eldono de b2evolution.

source: If you had hacks or other customizations to the core files, your can bring those back now. We recommend you get yourself a diff/merge tool like <a %s>WinMerge</a>. This will allow you to easily compare your old (backuped) files with the new files (even whole directories at once) and report changes accordingly.
eo: Se vi faris evitaĵojn aŭ aliajn alproprigaĵojn de la kernaj dosieroj, vi nun povas restarigi tiujn. Rekomendinde estas uzi kunfandilon ekz-e <a %s>WinMerge</a>. Tio faciligos komparon de viaj sekurkopiaj dosieroj kun la novaj dosieroj (eĉ tutaj dosierujoj samtempe) kaj taŭge raporti ŝanĝojn.

source: Upgrading from Movable Type
eo: Promocio disde Movable Type

source: This procedure has been tested with Movable Type version 2.661 but should also work with other versions. You can't break anything by trying anyway...
eo: La proceduro estas provita kun eldono 2.661 de Movable Type, sed funkciu kun aliaj eldonoj. Provoj ne rompos ion.

source: Use MT's export functionnality to create a .TXT file containing your posts.
eo: Uzu la eksportilon de Movable Type por krei tekstodosieron, kiu enhavas viajn afiŝojn.

source: <a %s>Install b2evolution in the regular way.</a>
eo: <a %s>Instali b2evolution-on laŭ la regula maniero.</a>

source: Once b2evo is up and running, copy your .TXT export file into the /blogs/admin folder on your server.
eo: Post kiam b2evolution funkcias kopiu viajn eksportitajn tekstodosierojn en la estran dosierujon /blogs/ en via servilo.

source: In the admin, go to the Tools tab and launch the MT migration utility.
eo: En la administrilon uzu la folion Iloj por lanĉi la elmigrilon disde Movable Type.

source: Follow the instructions on screen.
eo: Faru la instrukciojn surekranajn.

source: Import will only take a few seconds/minutes depending on how many posts you import.
eo: Importi postulos nur kelkajn sekundojn aŭ minutojn, depende de kiom da afiŝoj importotaj.

source: Upgrading from WordPress
eo: Promocio disde WordPress

source: This procedure has been tested with WordPress version 2.3. It will not work with prior versions. It may work with superior versions. You can't break your WordPress by trying anyway...
eo: La proceduro estas provita kun eldono 2.3 de WordPress. Ĝi ne funkcias kun pli fruaj eldonoj. Ĝi eble funkcias kun pli malfruaj eldonoj. Provoj ne fuŝos vian WordPress-blogon…

source: Once b2evo is up and running, in the admin, go to the Tools tab and launch the WordPress import utility.
eo: Post kiam b2evolution funkcias uzu la administrilan folion Iloj por lanĉi la importilon de WordPress.

source: Follow the instructions on screen and provide connection information to your WordPress database (Read Only)
eo: Faru la instrukciojn surekranajn kaj provizu konektajn informojn de via WordPress-datumbazo (nurlega)
